rainer20512/stm32-fw/stm32h7/h745/CM7/Src/main_c7.c
/**
  ******************************************************************************
  * @file    FreeRTOS/FreeRTOS_AMP_Dual_RTOS/CM7/Src/main.c
  * @author  MCD Application Team
  *          This is the main program for Cortex-M7 
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

/* Standard includes. */
#include "stdio.h"
#include "string.h"
#include "log.h"

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "message_buffer.h"
#include "MessageBufferAMP.h"
#include "ipc.h"
#include "system/hw_util.h"
#include "system/clockconfig.h"
#include "system/mpu.h"
#include "eeprom.h"
#include "dev/devices.h"
#include "task/minitask.h"
#include "debug_helper.h"
#include "timer.h"

#include "bsp/arduino_wrapper.h"
#include "system/tm1637.h"

#include "cmsis_os.h"

#if defined(STM32H745NUCLEO)
    #include "STM32H7xx_Nucleo/stm32h7xx_nucleo.h"
#elif defined(STM32H747IDISCO)
    #include "STM32H747I-DISCO/stm32h747i_discovery.h"
#elif defined(PORTENTAH7)
    #include "bsp/portenta_h7.h"
#endif

#define INIT_STACK_SIZE 256

/* external variables --------------------------------------------------------*/
extern uint32_t __SRAMUNCACHED_segment_start__;
extern uint32_t __SRAM4CM7_segment_start__;

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/ 
#define mainCHECK_TASK_PRIORITY			( configMAX_PRIORITIES - 2 )

/* Private variables ---------------------------------------------------------*/
static IPCMEM uint8_t StorageBuffer_data[mbaNUMBER_OF_CORE_2_TASKS][ mbaTASK_MESSAGE_BUFFER_SIZE ];
static IPCMEM uint8_t StorageBuffer_back[ mbaTASK_MESSAGE_BUFFER_SIZE ];

osSemaphoreId osSemaphore;
/* Exported variables --------------------------------------------------------*/
uint32_t gflags;

#if DEBUG_MODE 
  uint32_t console_debuglevel;
  uint32_t fatfs_debuglevel;
//  uint32_t debuglevel;
#endif

/* Private function prototypes -----------------------------------------------*/
static void CPU_CACHE_Enable(void);
static void MPU_Setup(void);


/* Forward declarations for external initialization functions -----------------*/
void HW_InitJtagDebug(void);
void Init_DumpAndClearResetSource(void);
void Init_OtherDevices(void);
void Init_DefineTasks(void);

int I2C_PMIC_Setup(void);
int I2C_PMIC_Initialize(void);
int I2C_PMIC_Reset(void);
void PMIC_OTP_Dump(void);

static void prvCheck2Task   ( void *pvParameters );
static void prvCore1Task    ( void *pvParameters );
static void prvCheckTask    ( void *pvParameters );
static void prvCore1InitTask( void *pvParameters );
static void prvCore1ModifiedTask( void *pvParameters );

static BaseType_t xAreMessageBufferAMPTasksStillRunning( void );
void vApplicationGetIdleTaskMemory( StaticTask_t **ppxIdleTaskTCBBuffer, uint32_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize );
/* Private functions ---------------------------------------------------------*/


static uint32_t _wait(uint32_t duration )
{
    uint32_t k=0;
    for ( uint32_t j=0; j < duration * 2000; j++ ) {
        k += j;
        asm("nop");
    }
    return k;
}

void LedToggle ( uint32_t duration, uint32_t num, uint32_t lednum )
{  
    for ( uint32_t i = 0; i < num; i++ ) {
        BSP_LED_Toggle(lednum);
        _wait(duration);
        BSP_LED_Toggle(lednum);
        (void)_wait(duration);
    }
}

#define SHORT 500
#define LONG 1000
/******************************************************************************
 * Blink the red led forever as primitive error indicator
 * duration = coarse interval in ms
 *****************************************************************************/
void ErrorLed ( uint32_t d1, uint32_t d2, uint32_t d3 )
{
    #define OFFTIME SHORT
    for ( ;; ) {
        BSP_LED_On(LED_RED);
        _wait(d1);
        BSP_LED_Off(LED_RED);
        _wait(OFFTIME);

        BSP_LED_On(LED_RED);
        _wait(d2);
        BSP_LED_Off(LED_RED);
        _wait(OFFTIME);

        BSP_LED_On(LED_RED);
        _wait(d3);
        BSP_LED_Off(LED_RED);
        _wait(OFFTIME*4);
    }
}

void PB_CB ( uint16_t u, uint16_t pinvalue, void * arg )
{  
    UNUSED(u);UNUSED(arg);
    osSemaphoreRelease (osSemaphore);
    DEBUG_PRINTF("User Button=%d\n", pinvalue);
}


/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
#define STATUS(i)   TM1637_displayInteger(i,0,99)
int main(void)
{
    int32_t timeout;

    /* Program PMIC*/
    timeout = I2C_PMIC_Setup();
    if ( timeout == 0 ) timeout = I2C_PMIC_Initialize();
    if ( timeout != 0 ) Error_Handler_XX(-1, __FILE__, __LINE__);
    
    I2C_PMIC_Reset();

    DEBUG_PRINTF("RCC->RSR= 0x%04x\n", RCC_C1->RSR >> 16  ); 

    /* 
     * STM32H745 Nucleo does only support SMPS. So select once at startup 
     * and do not touch again. Due to this, VOS scale0 is inhibited and
     * max SYSCLK is 400MHZ.
     */
#if defined(PORTENTAH7)
    /* Portenta H7 uses internal SMPS to power internal LDO, which powers core */
    HAL_PWREx_ConfigSupply(PWR_SMPS_2V5_SUPPLIES_LDO);
   #else 
    /* Nucleo boards use internal SMPS to power core */
    HAL_PWREx_ConfigSupply(PWR_DIRECT_SMPS_SUPPLY);
#endif
    #if defined(STM32H745xx)
        ARD_PinT clk = { GPIOA, 3 };
        ARD_PinT dio = { GPIOC, 0 };
    #elif defined(STM32H747xx)
        ARD_PinT clk = { GPIOJ, 3 }; // Arduion Conn CN6/D2
        ARD_PinT dio = { GPIOF, 8 }; // Arduion Conn CN6/D3
    #endif

