rainer20512/stm32-fw/stm32h7/h745/CM7/Src/main_c7.c
    BSP_LED_Init(LED_RED); 

    /* configure SWDIO and SWCLK pins, configure DBG and clear software reset flag in RCC */
    HW_InitJtagDebug();  


    /* 
     * MPU Configuration: Define Flash ReadOnly (to detect faulty flash write accesses) 
     * Define SRAM3 as not cacheable and not bufferable ( used as DMA buffers & IPC mem )
     */
    MPU_Setup();

    /* Enable the D- and I- Cache for M7  */
    CPU_CACHE_Enable();

    BSP_LED_Init(LED2); 
    
    LedToggle(250,2,LED2);
    
    TM1637_Init( clk, dio, DELAY_TYPICAL);

    /* Init variables and structures for device handling */
    DevicesInit();

    /* Assert that CM4 is available */
    if ( (*((uint32_t *)(SYSCFG_BASE+0x100)) & (1 << 16)) == 0 ) ErrorLed( SHORT, SHORT, SHORT ); // Short, Short, Short = No CM4 core

    /* If CM4 is gated, start CM4 now */
    if ( (SYSCFG->UR1 & SYSCFG_UR1_BCM4) == 0 ) {
       // ErrorLed( SHORT, SHORT, LONG ); // Short, Short, Long = UNUSED
       HAL_RCCEx_EnableBootCore(RCC_BOOT_C2);
    }

    timeout = 1600000;
    while((__HAL_RCC_GET_FLAG(RCC_FLAG_D2CKRDY) != RESET) && (timeout-- > 0));
    if ( timeout < 0 )
    {
        ErrorLed( SHORT, LONG, SHORT ); // Short, Long, Short = CM4 did not boot
    }

    #if USE_BASICTIMER > 0
        /* 
         * Start microsecond counter , must be done before Profiler is initialized 
         * and before HAL_Init, in case of USE_BASICTIMER_FOR_TICKS == 1
         */
        BASTMR_EarlyInit();
    #endif

    #if USE_QSPI  > 0 && USE_EEPROM_EMUL > 0
        QSPI_EarlyInit();
    #endif
    
    /* Do board specific hardware initialization */
    BSP_Board_Init();

    HAL_Init();

    STATUS(0);

    /* configure "simulated EEPROM" in flash and read config settings */
    Config_Init();
    Log_SetDebugLevels((uint32_t)config.dbg_level);

    /* 
    * Select clock source as configured in config variable, 
    * switch off MSI clock if no longer used
    */
    SystemClock_SetConfiguredClock();
    STATUS(11);

    // Switch LSE Clock on 
    LSEClockConfig(true, true);

    /* Peripheral clock to HSE ( 8Mhz ) */
    SetPeripheralClkSource(CLKP_HSE);

    /* Configure the system clock to 400 MHz */
    // SystemClock_Config();

    BSP_LED_Init(LED1);
    BSP_LED_Init(LED2);
  

    STATUS(1);

    #if DEBUG_PROFILING > 0
        ProfilerInitTo(JOB_TASK_INIT);
    #endif

    STATUS(2);

    /* Set neccessary peripheral clocks and initialize IO_DEV and debug u(s)art */
    BasicDevInit();
    STATUS(3);
    Init_DumpAndClearResetSource();
    STATUS(4);

    DEBUG_PRINTF("RCC->RSR= 0x%04x\n", RCC_C1->RSR >> 16  ); 

    /* AIEC Common configuration: make CPU1 and CPU2 SWI line0
    sensitive to rising edge : Configured only once */
    HAL_EXTI_EdgeConfig(EXTI_LINE0 , EXTI_RISING_EDGE);
    HAL_EXTI_EdgeConfig(EXTI_LINE1 , EXTI_RISING_EDGE);

    HAL_NVIC_SetPriority(EXTI1_IRQn, 0xFU, 0U);
    HAL_NVIC_EnableIRQ(EXTI1_IRQn);

    
    MPU_Dump();
    DEBUG_PRINTF("HSI    = %dMHz\n", HSI_VALUE/1000000 ); 
    DEBUG_PRINTF("SYSCLK = %d\n", Get_SysClockFrequency() ); 
    DEBUG_PRINTF("SYSCLK = %dMHz\n", HAL_RCC_GetSysClockFreq()/1000000 ); 
    DEBUG_PRINTF("AHBCLK = %dMHz\n", HAL_RCC_GetHCLKFreq()/1000000 );
    DEBUG_PRINTF("APBCLK = %dMHz\n", HAL_RCC_GetPCLK1Freq()/1000000 );
    PMIC_OTP_Dump();

    Init_OtherDevices();
    STATUS(5);

    Init_DefineTasks();
    STATUS(6);

    #if DEBUG_PROFILING > 0
        ProfilerSwitchTo(JOB_TASK_MAIN);  
    #endif

    
    /* 
     * Write address of control message buffer to RTC backup ram address 0 
     * from there it will be read upon startup from M4 core 
     */
    CTRL_HOOK_ENABLE_ACCESS();
    CTRL_BLOCK_HOOK_PUT(AMPCtrl_Block);
    MSGBUF_HOOK_PUT(AMP_DirectBuffer);
    CTRL_HOOK_DISABLE_ACCESS();

    /* Define used semaphore */
    osSemaphoreDef(SEM);  
    /* Create the semaphore */
    osSemaphore = osSemaphoreCreate(osSemaphore(SEM) , 1);

    IO_AssignInterrupt(GPIO_PIN_13, PB_CB );


    /* Start the Core 1 init task, this task will start all other tasks */
    xTaskCreate( prvCore1InitTask, "Core1Init", INIT_STACK_SIZE, NULL, configMAX_PRIORITIES, NULL);		

    STATUS(7);

    /* Start scheduler */
    vTaskStartScheduler();
    /* We should never get here as control is now taken by the scheduler */
    for (;;);
}

/**
  * @brief  BSP Configuration
  * @param  None
  * @retval None
  */

/* Initialization of CM7 Tasks and RTOS environment */
static void prvCore1InitTask( void *pvParameters )
{
  
    UNUSED(pvParameters);

    Ipc_CM7_Init();

    /* Create control message buffer */
    /* Create data message buffer */
    for( uint32_t x = 0; x < mbaNUMBER_OF_CORE_2_TASKS; x++ ) {
        DataMessageBuffer(x) = xMessageBufferCreateStatic( mbaTASK_MESSAGE_BUFFER_SIZE, StorageBuffer_data[x], &DataStreamBuffer(x));
        configASSERT( DataMessageBuffer(x) );
    }

    DataMessageBuffer(2) = xMessageBufferCreateStatic( mbaTASK_MESSAGE_BUFFER_SIZE, StorageBuffer_back, &DataStreamBuffer(2));
    configASSERT( DataMessageBuffer(2) );

    AMPCtrl_Block.num_xfer_used = 3;

    /* Start system tasks */
    TaskInitAll();
    STATUS(8);
    
    TaskNotify(TASK_LOG);

    /* Wake up CM4 from initial stop */
    Ipc_CM7_WakeUp_CM4 ();

#if 0
    /* Start the check task */
    xTaskCreate( prvCheckTask, "Check", configMINIMAL_STACK_SIZE, NULL, mainCHECK_TASK_PRIORITY, NULL );

    /* Start the check2 task */
    xTaskCreate( prvCheck2Task, "Check2", configMINIMAL_STACK_SIZE, (void *)2, mainCHECK_TASK_PRIORITY, NULL );

    /* Start the Core 1 task */
    xTaskCreate( prvCore1Task, "AMPCore1", 256, NULL, tskIDLE_PRIORITY, NULL );		

    /* Start the Modified Core 1 task */
    xTaskCreate( prvCore1ModifiedTask, "Mod1", 256, NULL, tskIDLE_PRIORITY, NULL );		
#endif

    STATUS(99);

    /* Terminate initialization task */ 
    vTaskDelete(NULL);
}
/* This task will periodically send data to tasks running on Core 2
   via message buffers. */
static void prvCore1Task( void *pvParameters )
{
  BaseType_t x;
  uint32_t ulNextValue = 0;
  const TickType_t xDelay = pdMS_TO_TICKS( 250 );
  char cString[ 15 ];
  
  /* Remove warning about unused parameters. */
  ( void ) pvParameters;

  for( ;; )
  {
    /* Create the next string to send.  The value is incremented on each
    loop iteration, and the length of the string changes as the number of
    digits in the value increases. */
    sprintf( cString, "%lu", ( unsigned long ) ulNextValue );

    /* Send the value from this Core to the tasks on the Core 2 via the message 
    buffers.  This will result in sbSEND_COMPLETED()
    being executed, which in turn will write the handle of the message
    buffer written to into xControlMessageBuffer then generate an interrupt
    in core 2. */
    for( x = 0; x < mbaNUMBER_OF_CORE_2_TASKS; x++ )
    {
      DEBUG_PRINTF("Send %d on task#%d\n", ulNextValue, x);
      if ( xSemaphoreTake(DataMessageSem(x), pdMS_TO_TICKS(100000)) == pdTRUE ) {
          xMessageBufferSend( DataMessageBuffer(x), 
                             ( void * ) cString,
                             strlen( cString ),
                             mbaDONT_BLOCK );
          xSemaphoreGive(DataMessageSem(x));
      } else {
          DEBUG_PRINTF("Failed to obtain DataSemaphore %d\n", x );
      }
      /* Delay before repeating */
      vTaskDelay( xDelay );
    }

