rainer20512/stm32-fw/stm32h7/h745/CM7/Src/main_c7.c
    ulNextValue++;
    DEBUG_PRINTF("Send packet %d\n", ulNextValue);
  }
}


/* This task will periodically send data to tasks running on Core 2
   via message buffers. */
static void prvCore1ModifiedTask( void *pvParameters )
{
  BaseType_t x;
  uint32_t ulNextValue = 0;
  char cString[ 15 ];
  
  /* Remove warning about unused parameters. */
  ( void ) pvParameters;

  while(1) {
      if ( osSemaphoreWait(osSemaphore , 100000) != osOK ) {
        DEBUG_PUTS("Giving up waiting for semaphore");
        vTaskDelete(NULL);
      }
      for( uint32_t loops = 0; loops < 40 ; loops++ )
      {
        /* Create the next string to send.  The value is incremented on each
        loop iteration, and the length of the string changes as the number of
        digits in the value increases. */
        sprintf( cString, "%lu", ( unsigned long ) ulNextValue );
    
        /* Send the value from this Core to the tasks on the Core 2 via the message 
        buffers.  This will result in sbSEND_COMPLETED()
        being executed, which in turn will write the handle of the message
        buffer written to into xControlMessageBuffer then generate an interrupt
        in core 2. */
        for( x = 0; x < mbaNUMBER_OF_CORE_2_TASKS; x++ )
        {
          if ( xSemaphoreTake(DataMessageSem(x), pdMS_TO_TICKS(100000)) == pdTRUE ) {
              xMessageBufferSend( DataMessageBuffer(x), 
                                 ( void * ) cString,
                                 strlen( cString ),
                                 mbaDONT_BLOCK );
              xSemaphoreGive(DataMessageSem(x));
          } else {
              DEBUG_PRINTF("Failed to obtain DataSemaphore %d\n", x );
          }
          /* Delay before repeating */
          // vTaskDelay( xDelay );
        }

        ulNextValue++;
        DEBUG_PRINTF("Send packet %d\n", ulNextValue);
      }
  }
}


/* 
  Check if the application still running
*/
static uint32_t ulLastCycleCounters[ mbaNUMBER_OF_CORE_2_TASKS ] = { 0 };
static BaseType_t xAreMessageBufferAMPTasksStillRunning( void )
{
  BaseType_t xDemoStatus = pdPASS;
  BaseType_t x;
  
  /* Called by the check task to determine the health status of the tasks
  implemented in this demo. */
  for( x = 0; x < mbaNUMBER_OF_CORE_2_TASKS; x++ )
  {
    if( ulLastCycleCounters[ x ] == ulCycleCounters[ x ] )
    {
      xDemoStatus = pdFAIL;
    }
    else
    {
      ulLastCycleCounters[ x ] = ulCycleCounters[ x ];
    }
  }
  
  return xDemoStatus;
}
static void prvCheck2Task( void *pvParameters )
{
  BaseType_t x;
  uint32_t val;
  uint32_t xReceivedBytes;
  
  /* The index into the xDataMessageBuffers and ulLoopCounter arrays is
  passed into this task using the task's parameter. */
  x = ( BaseType_t ) pvParameters;
  for( ;; )
  {
    xReceivedBytes = xMessageBufferReceive( DataMessageBuffer( x ),
                                            &val,
                                            sizeof( uint32_t ),
                                            portMAX_DELAY );
    
    /* Check the number of bytes received was as expected. */
    if (xReceivedBytes != sizeof(uint32_t) ) {
        DEBUG_PRINTF("Check2: Unexpected number of bytes received:%d vs %d\n", xReceivedBytes, sizeof(uint32_t));
    } else {
        /* If the received string matches that expected then increment the loop
        counter so the check task knows this task is still running. */
        if( val == 42 || val == 43  ) {
           ulLastCycleCounters[ val-42 ] ++; 
        } else {
          DEBUG_PRINTF("Checker got wrong return value %d\n",val);
        }
    }
    /* Expect the next string in sequence the next time around. */
  }
}

/* Check task fonction 
   */
static void prvCheckTask( void *pvParameters )
{
  TickType_t xNextWakeTime;
  const TickType_t xCycleFrequency = pdMS_TO_TICKS( 2000UL );
  
  /* Just to remove compiler warning. */
  ( void ) pvParameters;
  
  /* Initialise xNextWakeTime - this only needs to be done once. */
  xNextWakeTime = xTaskGetTickCount();
  
  for( ;; )
  {
    /* Place this task in the blocked state until it is time to run again. */
    vTaskDelayUntil( &xNextWakeTime, xCycleFrequency );

    
    if( xAreMessageBufferAMPTasksStillRunning() != pdPASS )
    {
      /* Application fail */
      BSP_LED_Off(LED1);
      BSP_LED_On(LED2);
    }
    else
    {
      /* Application still running */
      BSP_LED_Off(LED2);
      BSP_LED_Toggle(LED1);
    }
  }
}


/* configUSE_STATIC_ALLOCATION is set to 1, so the application must provide an
implementation of vApplicationGetIdleTaskMemory() to provide the memory that is
used by the Idle task. */
void vApplicationGetIdleTaskMemory( StaticTask_t **ppxIdleTaskTCBBuffer, uint32_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize )
{
  /* If the buffers to be provided to the Idle task are declared inside this
  function then they must be declared static - otherwise they will be allocated on
  the stack and so not exists after this function exits. */
  static StaticTask_t xIdleTaskTCB;
  static uint32_t uxIdleTaskStack[ configMINIMAL_STACK_SIZE ];

      /* Pass out a pointer to the StaticTask_t structure in which the Idle task's
      state will be stored. */
      *ppxIdleTaskTCBBuffer = &xIdleTaskTCB;

      /* Pass out the array that will be used as the Idle task's stack. */
      *ppxIdleTaskStackBuffer = uxIdleTaskStack;

      /* Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.
      Note that, as the array is necessarily of type StackType_t,
      configMINIMAL_STACK_SIZE is specified in words, not bytes. */
      *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE BYPASS)
  *            SYSCLK(Hz)                     = 400000000 (CPU Clock)
  *            HCLK(Hz)                       = 200000000 (Cortex-M4 CPU, Bus matrix Clocks)
  *            AHB Prescaler                  = 2
  *            D1 APB3 Prescaler              = 2 (APB3 Clock  100MHz)
  *            D2 APB1 Prescaler              = 2 (APB1 Clock  100MHz)
  *            D2 APB2 Prescaler              = 2 (APB2 Clock  100MHz)
  *            D3 APB4 Prescaler              = 2 (APB4 Clock  100MHz)
  *            HSE Frequency(Hz)              = 8000000
  *            PLL_M                          = 4
  *            PLL_N                          = 400
  *            PLL_P                          = 2
  *            PLL_Q                          = 4
  *            PLL_R                          = 2
  *            VDD(V)                         = 3.3
  *            Flash Latency(WS)              = 4
  * @param  None
  * @retval None
  */
#if 0
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  HAL_StatusTypeDef ret = HAL_OK;

