rainer20512/stm32-fw/stm32h7/h745/CM7/Src/main_c7.c
  /*!< Supply configuration update enable */
  HAL_PWREx_ConfigSupply(PWR_DIRECT_SMPS_SUPPLY);

  /* The voltage scaling allows optimizing the power consumption when the device is
     clocked below the maximum system frequency, to update the voltage scaling value
     regarding system frequency refer to product datasheet.  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
  RCC_OscInitStruct.CSIState = RCC_CSI_OFF;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;

  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 400;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLQ = 4;

  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_2;
  ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
  if(ret != HAL_OK)
  {
    Error_Handler(__FILE__, __LINE__);
  }

/* Select PLL as system clock source and configure  bus clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_D1PCLK1 | RCC_CLOCKTYPE_PCLK1 | \
                                 RCC_CLOCKTYPE_PCLK2  | RCC_CLOCKTYPE_D3PCLK1);

  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;
  ret = HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4);
  if(ret != HAL_OK)
  {
    Error_Handler(__FILE__, __LINE__);
  }

  /*activate CSI clock mondatory for I/O Compensation Cell*/
  __HAL_RCC_CSI_ENABLE() ;

  /* Enable SYSCFG clock mondatory for I/O Compensation Cell */
  __HAL_RCC_SYSCFG_CLK_ENABLE() ;

  /* Enables the I/O Compensation Cell */
  HAL_EnableCompensationCell();

}
#endif
/**
* @brief  CPU L1-Cache enable.
* @param  None
* @retval None
*/
static void CPU_CACHE_Enable(void)
{
  /* Enable I-Cache */
  SCB_EnableICache();

  /* Enable D-Cache */
  SCB_EnableDCache();
}

#define PWROF2(a)               ( (a & (a-1)) == 0 ) 
#define DEFINE_EXTERNALS(a)     \
                                extern uint32_t __##a##_segment_start__; \
                                extern uint32_t __##a##_segment_size__; \

/******************************************************************************
 * define MPU regions and enable them
 *  - all flash as RO memory ( to detect faulty flash writes )
 *  - DMA buffers as uncached
 *  - LWIP heap as uncached
 *  - ETH DMA descriptors as device memory
 *****************************************************************************/
static void MPU_Setup(void)
{
   DEFINE_EXTERNALS(SRAMUNCACHED); 
   DEFINE_EXTERNALS(SRAM4CM7); 

   uint32_t flashSize = *(uint16_t*)FLASHSIZE_BASE * 1024;

    MPU_AddRegion ( FLASH_BANK1_BASE,                          MPUTPYE_FLASH_NOWRITE,        flashSize,                                0 );
    MPU_AddRegion ( (uint32_t)&__SRAMUNCACHED_segment_start__, MPUTYPE_RAM_NONCACHEABLE,     (uint32_t)&__SRAMUNCACHED_segment_size__, 1 );
    MPU_AddRegion ( (uint32_t)&__SRAM4CM7_segment_start__,     MPUTYPE_RAM_NONCACHEABLE,     (uint32_t)&__SRAM4CM7_segment_size__,     2 );

    MPU_EnableAllRegions();
    MPU_Dump();

}
#if 0
/* Definition of non cached memory areas */
typedef struct {
    uint32_t baseAddress;
    uint32_t regionSize;
} MPURegionT;

#define MAX_MPU_REGIONS     2                       /* Number of defined MPU regions */
static MPURegionT mpuRegions[MAX_MPU_REGIONS]; 

/******************************************************************************
 * define MPU regions
 *****************************************************************************/
static void MPU_Setup(void)
{
    mpuRegions[0].baseAddress = (uint32_t)&__SRAMUNCACHED_segment_start__;
    mpuRegions[0].regionSize  = MPU_REGION_SIZE_16KB;
    /**** 003 ****/
    mpuRegions[1].baseAddress = (uint32_t)&__SRAM4CM7_segment_start__;
    mpuRegions[1].regionSize  = MPU_REGION_SIZE_32KB;
}


/******************************************************************************
 * configure the previously defined MPU regions
 *****************************************************************************/
static void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;
  
  /* Disable the MPU */
  HAL_MPU_Disable();

  /* Configure the MPU "constant" attributes once */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

  /* Now configure the "dynamic attributes for every region and setup MPU */
  for ( uint32_t i = 0; i < MAX_MPU_REGIONS; i++ ) {
      MPU_InitStruct.BaseAddress = mpuRegions[i].baseAddress;
      MPU_InitStruct.Size = mpuRegions[i].regionSize;
      HAL_MPU_ConfigRegion(&MPU_InitStruct);
  }

  /* Configure the MPU attributes as RO for CM7 Flash */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = FLASH_BANK1_BASE;
  MPU_InitStruct.Size = MPU_REGION_SIZE_1MB;
  MPU_InitStruct.AccessPermission = MPU_REGION_PRIV_RO_URO;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* Enable the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

/******************************************************************************
 * dump info about every configured MPU region
 *****************************************************************************/
static void MPU_Dump(void)
{
  for ( uint32_t i = 0; i < MAX_MPU_REGIONS; i++ ) {
      DEBUG_PRINTF("Uncached RAM at 0x%p of size 0x%08x\n", 
        mpuRegions[i].baseAddress, 
        2 << mpuRegions[i].regionSize 
      );
  }
}

#endif

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
